#### Day 5: Aggregate Functions and GROUP BY üéâ

Today we explore summarizing data using functions like COUNT, SUM, AVG, MIN, MAX and the GROUP BY clause.

#### 1. Database Connection

In [7]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to '30_Days_SQL'!

---

#### Practice Exercises üìù

#### 1. Total number of students in each course

In [8]:
query = "SELECT course, COUNT(*) AS student_count FROM students GROUP BY course"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13908\694316798.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

    course  student_count
0     Math              3
1  Physics              1
2  Science              2

#### 2. Average salary of employees in each department (using IDs)

In [9]:
query = "SELECT department_id, AVG(salary) AS average_salary FROM employees GROUP BY department_id"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13908\460132216.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   department_id  average_salary
0              1         55000.0
1              2         90000.0
2              3         87500.0
3              4         70000.0

#### 3. Minimum and maximum price of products in each category

In [10]:
query = "SELECT category, MIN(price) AS min_price, MAX(price) AS max_price FROM products GROUP BY category"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13908\1757397085.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

      category  min_price  max_price
0    Education       20.0       20.0
1  Electronics       25.0     1200.0
2    Furniture      150.0      300.0

#### 4. Count the number of orders placed by each customer
(First, create the orders table matching common_db schema)

In [11]:
cursor.execute("DROP TABLE IF EXISTS orders")
cursor.execute('''
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    product_id INT,
    order_date DATE,
    order_total DECIMAL(10, 2),
    comments TEXT
)
''')

orders_data = [
    (101, 1, 1, '2024-01-10', 1200.00, 'Fast delivery'),
    (102, 2, 2, '2024-02-15', 1500.00, 'Good service'),
    (103, 1, 3, '2024-03-01', 3000.00, 'Repeat order'),
    (104, 3, 4, '2024-03-20', 800.00, 'Satisfied'),
    (105, 2, 5, '2024-04-10', 2000.00, 'Bulk order'),
    (106, 1, 6, '2024-05-05', 1000.00, 'Discount applied')
]
cursor.executemany("INSERT INTO orders VALUES (%s, %s, %s, %s, %s, %s)", orders_data)
conn.commit()

query = "SELECT customer_id, COUNT(*) AS order_count FROM orders GROUP BY customer_id"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13908\1724318810.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   customer_id  order_count
0            1            3
1            2            2
2            3            1

In [12]:
conn.close()